cleanli2/stm32/src/cmd.c
}
void adc(char *p)
{
    (void)p;
    con_send('\n');
    adc_test();

    return;

}
void cmd_exit(char *p)
{
    (void)p;
    lprintf("Quit CMD!\n");
    quit_cmd = 1;

    return;

}
void rebootd(char *p)
{
    (void)p;

    reboot_download();

    return;

}
void reboot(char *p)
{
    (void)p;
    soft_reset_system();

    return;

}
#define BLOCK_SIZE 0x400
void fmerase(char *p)
{
    uint32_t er_ct = 1, addr;
    //uint32_t len = 0xffff, data = 0;
    //uint32_t dp = (uint32_t*)0x08010000;
    FLASH_Status fret;

    lprintf("\n");
    uint32_t tmp = get_howmany_para(p);
    if(tmp==0)goto err;
    if(tmp>=1){
        p = str_to_hex(p, &addr);
    }
    if(tmp>=2){
        p = str_to_hex(p, &er_ct);
    }
    FLASH_Unlock();
    while(er_ct--){
        if(FLASH_COMPLETE == (fret=FLASH_ErasePage(addr))){
            lprintf("flash oper done @%X\n", addr);
        }
        else{
            lprintf("flash oper err:%d @addr %X\n", fret, addr);
        }
        addr+=BLOCK_SIZE;
    }
    FLASH_Lock();
#if 0
    while(len){
        if(*dp++ != data){
            ne_ct++;
            lprintf("\rNE:%d", ne_ct);
        }
        len -= 4;
    }
#endif

    return;
err:
    lprintf("err:fmerase addr count\n");
    return;

}
void fmwtest(char *p)
{
    uint32_t len = 1, data = 0, addr;
    //uint32_t ne_ct = 0;
    //uint32_t dp = (uint32_t*)0x08010000;
    FLASH_Status fret;

    lprintf("\n");
    uint32_t tmp = get_howmany_para(p);
    if(tmp>=2){
        p = str_to_hex(p, &data);
        p = str_to_hex(p, &addr);
        if(tmp>=3) p = str_to_hex(p, &len);
        FLASH_Unlock();
        while(len){
            if(FLASH_COMPLETE == (fret=FLASH_ProgramWord(addr, data))){
                //lprintf("flash oper done\n");
            }
            else{
                lprintf("flash oper err:%d adr %X\n", fret, addr);
            }
            addr+=4;
            len-=4;
        }
        FLASH_Lock();
    }
    else{
        lprintf("err:fmwtest data addr (len)\n");
    }
#if 0
    while(len){
        if(*dp++ != data){
            ne_ct++;
            lprintf("\rNE:%d", ne_ct);
        }
        len -= 4;
    }
#endif

    return;

}
void fmrtest(char *p)
{
    uint32_t len = 0xffff, ne_ct = 0, data = 0, addr;
    uint32_t* dp = (uint32_t*)0x08010000;

    lprintf("\n");
    uint32_t tmp = get_howmany_para(p);
    if(tmp<3){
        goto err;
    }
    else{
        p = str_to_hex(p, &data);
        p = str_to_hex(p, &addr);
        p = str_to_hex(p, &len);
        dp = (uint32_t*)addr;
        while(len){
            if(*dp++ != data){
                ne_ct++;
                lprintf("\rNE:%X addr %X", ne_ct, (uint32_t)(dp-1));
            }
            len -= 4;
        }
    }
    lprintf("\n\n");
    return;

err:
    lprintf("fmrtest data addr len\n");
    return;

}
void usb_strg_init(char *p)
{
    uint32_t n, p1 = 0;
    n = get_howmany_para(p);
    if(n>0){
        p = str_to_hex(p, &p1);
        lprintf("p1=%d\n", p1);
    }
    usb_main_init(p1);
}
void logflag(char *p)
{
    uint32_t n, p1 = 0;
    n = get_howmany_para(p);
    if(n>0){
        p = str_to_hex(p, &p1);
        lprintf("logf set to %x\n", p1);
    }
    logv = p1;
}
void test(char *p)
{
    uint32_t px1, py1, s,e;
    static int txc=0;
    p = str_to_hex(p, &px1);
    p = str_to_hex(p, &py1);
    p = str_to_hex(p, &s);
    p = str_to_hex(p, &e);
    lprintf("para:%x %x %x %x\n", px1,py1,s,e);

    LCD_Clear(WHITE);
    if(txc++&0x1){
        lprintf("old\n");
        LCD_DrawLine(240, 400, px1, py1);
    }
    else{
        lprintf("new\n");
        LCD_DrawLine_direction(240, 400, px1, py1, s, e);
    }
#if 0
    uint32_t n, p1, p2;
    uint64_t t1, t2, t3,t4,t5,t6,t7;
    t1= get_system_us();
    n = get_howmany_para(p);
    t2= get_system_us();
    p = str_to_hex(p, &p1);
    beep_by_timer(p1);
    return;
    t3= get_system_us();
    if(n==1){
    t4= get_system_us();
        delay_us(p1);
    t5= get_system_us();
    }
    else{
    t4= get_system_us();
        delay_ms(p1);
    t5= get_system_us();
    }
    t6= get_system_us();
    t7= get_system_us();
    lprintf("1:%U\n", t1);
    lprintf("2:%U\n", t2);
    lprintf("3:%U\n", t3);
    lprintf("4:%U\n", t4);
    lprintf("5:%U\n", t5);
    lprintf("6:%U\n", t6);
    lprintf("7:%U\n", t7);
#endif
    return;

}
void tm(char *p)
{
    uint32_t tmp, para;
    con_send('\n');
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp<1){
        return;
    }
    p = str_to_hex(p, &para);
    task_mask = para;
    lprintf("task_mask=%X\n", task_mask);

    return;

}

void history(char *p)
{
    (void)p;
    uint32_t n = CMD_CACHES_SIZE, cix = cmdcache_index;
    con_send('\n');
    while(n--){
        if(cix==0){
            cix = CMD_CACHES_SIZE-1;
        }
        else{
            cix--;
        }
        if(cmd_caches[cix][0]!=0){
            lprintf("%s\n", cmd_caches[cix]);
        }
    }
    con_send('\n');

    return;
}

void keytest(char *p)
{
    (void)p;
    uint8_t rchar;
    con_send('\n');
    while((rchar=con_recv())!=ENTER_CHAR){
        lprintf("%b\n", rchar);
    }
    con_send('\n');

    return;

}
void envprint(char *p)
{
    (void)p;
    printenv();
    con_send('\n');

    return;

}
void envget(char *p)
{
    uint32_t tmp;
    char* name, value[ENV_MAX_VALUE_LEN];
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp<1){
        lprintf("err\n");
        return;
    }
    str_to_str(p, &name);
    if(ENV_FAIL == get_env(name, value)){
        lprintf("get_env fail\n");
        return;
    }
    else{
        lprintf("get_env OK\n");
    }
    lprintf("%s=%s\n", name, value);
    con_send('\n');

    return;

}
void envset(char *p)
{
    uint32_t tmp;
    char* name, *value=0;
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp<1){
        lprintf("err\n");
        return;
    }
    if(tmp>=1){
        p = str_to_str(p, &name);
    }
    if(tmp>=2){
        p = str_to_str(p, &value);
    }
    if(value){
        lprintf("todo: %s=%s\n", name, value);
    }
    else{
        lprintf("todo: del %s\n", name);
    }
    if(ENV_FAIL == set_env(name, value)){
        lprintf("set_env fail\n");
        return;
    }
    else{
        lprintf("set_env OK\n");
    }
    con_send('\n');

    return;

