cleanli2/stm32/src/cmd.c
}
void rtcs(char *p)
{
    (void)p;
    con_send('\n');
    if(RTC_OK==adjust_1min(0)){
        lprintf("slower 1 min OK\n");
    }
    else{
        lprintf("slower 1 min FAIL\n");
    }
    return;
}
void rtcf(char *p)
{
    (void)p;
    con_send('\n');
    if(RTC_OK==adjust_1min(1)){
        lprintf("faster 1 min OK\n");
    }
    else{
        lprintf("faster 1 min FAIL\n");
    }
    return;
}
void gpiotest(char *p)
{
    (void)p;
    con_send('\n');
    gpio_test();

    return;

}
void rtc_cmd(char *p)
{
    uint8_t d[6], tmp;

    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp==6){
        p = str_to_hex(p, (uint*)&d[0]);
        p = str_to_hex(p, (uint*)&d[1]);
        p = str_to_hex(p, (uint*)&d[2]);
        p = str_to_hex(p, (uint*)&d[3]);
        p = str_to_hex(p, (uint*)&d[4]);
        p = str_to_hex(p, (uint*)&d[5]);
        rtc_write(d);
    }
    else if(tmp==0){
        lprintf("%s\n", get_rtc_time(0));
    }
    else if(tmp==1){
        p = str_to_hex(p, (uint*)&d[0]);
        lprintf("read reg %b=%b\n", d[0], rtc_read_reg(d[0]));
    }
    else if(tmp==2){
        p = str_to_hex(p, (uint*)&d[0]);
        p = str_to_hex(p, (uint*)&d[1]);
        lprintf("write reg %b->%b\n", d[0], d[1]);
        rtc_write_reg(d[0], d[1]);
    }
    else{
        lprintf("error \n");
    }
    con_send('\n');

    return;

}
static const struct command cmd_list[]=
{
    //{"dwb",dispwb},
    {"adc",adc},
    {"bz",buzztest},
    {"exit",cmd_exit},
    {"envset",envset},
    {"envget",envget},
    {"envprint",envprint},
#ifndef WRITE_W25F
    {"fmerase",fmerase},
    {"fmrtest",fmrtest},
    {"fmwtest",fmwtest},
    {"go",go},
    {"gpiotest",gpiotest},
#endif
    {"help",print_help},
    {"history",history},
#ifndef WRITE_W25F
    //{"lcd19264init",lcd19264init},
    //{"lcd19264dc",dispcchar},
    {"kt",keytest},
    {"led",ledtest},
    {"logf",logflag},
    {"lst",lcdsuebinit},
    {"lstep",lcdsuebstep},
    {"lstest",lcdsuebtest},
#endif
    {"pm",print_mem},
    {"poff",poweroff},
    {"r",read_mem},
    {"reboot",reboot},
    {"rebootd",rebootd},
    {"rtc",rtc_cmd},
    {"rtcf",rtcf},
    {"rtcs",rtcs},
    {"sd",sd},
#ifndef WRITE_W25F
    //{"sdcmds",sd_cmds},
    {"test",test},
    {"taskmask",tm},
    //{"szk",show_ziku},
    {"usb",usb_strg_init},
#endif
    {"w",write_mem},
    {"w25f",w25f},
    {NULL, NULL},
};
static uint32_t * mrw_addr;
void go(char *para)
{
    (void)para;
	(*((void (*)())mrw_addr))();
}

void print_help(char *para)
{
    (void)para;
    uint i = 0;
    lprintf("Version %s%s\n", VERSION, GIT_SHA1);
    lprint("Cmd:\n");
    while(1){
            if(cmd_list[i].cmd_name == NULL)
                    break;
	    lprint("--%s\n", cmd_list[i].cmd_name);
            i++;
    }
}

uint asc_to_hex(char c)
{
	if(c >= '0' && c <= '9')
		return c - '0';	
	if(c >= 'A' && c <= 'F')
		return c - 'A' + 10;
	if(c >= 'a' && c <= 'f')
		return c - 'a' + 10;
	return 0;
}

uint get_howmany_para(char *s)
{
	uint tmp = 0;
	while(1){
		while(*s == ' ')
			s++;
		if(*s)
			tmp++;
		while(*s != ' ' && *s)
			s++;
		if(!*s)
			return tmp;
	}
}

char * str_to_str(char *s, char**result)
{
    while(*s == ' ')s++;
    *result=s;
    while(*s != ' ' && *s != 0)s++;
    if(*s==0){
        return NULL;
    }
    *s++=0;
    while(*s == ' ')s++;
    return s;
}

char * str_to_hex(char *s, uint * result)
{
	uint  i = 0;

	*result = 0;
	while(*s == ' ')s++;
	for(i=0;i<8;i++){
		if(*s == ' ' || *s == 0)
			break;
		*result = *result*16 + asc_to_hex(*s++);
	}
	while(*s == ' ')s++;
	return s;
}

void print_mem(char *p)
{
    uint length = 0x80, tmp, i;
    char *cp;

    tmp = get_howmany_para(p);
    if( tmp > 1)
        goto error;
    if(tmp == 0)
        goto print;
    str_to_hex(p, &length);
print:
    cp = (char *)mrw_addr;
    while(length){
	lprint("\n%x: ", (int)cp);
	for(i=0;i<16;i++){
		length--;
		lprintf("%b", *cp++);
		con_send(i == 7 ? '-':' ');
	}
    }
    con_send('\n');

    return;

error:
    lprint("Err!\npm [length](0x80 default)\n");

}

void write_mem(char *p)
{
    uint value, tmp;

    tmp = get_howmany_para(p);
    if(tmp == 0 || tmp > 2)
	goto error;
    p = str_to_hex(p, &value);
    if(tmp == 1)
        goto write;
    str_to_hex(p, (uint32_t*)&mrw_addr);
    mrw_addr = (uint32_t*)((uint32_t)mrw_addr & 0xfffffffc);
write:
    *(uint32_t*)mrw_addr = value;
    lprint("Write 0x%x@0x%x\n",value,mrw_addr);
    return;

error:
    lprint("Err!\nw (hexaddr) [(hexaddr)](last addr default)\n");

}


void read_mem(char *p)
{
    uint value, tmp;

    tmp = get_howmany_para(p);
    if( tmp > 1)
	goto error;
    if(tmp == 0)
    	goto read;
    str_to_hex(p, (uint32_t*)&mrw_addr);
    mrw_addr = (uint32_t*)((uint32_t)mrw_addr & 0xfffffffc);
read:
    value = *(uint32_t*)mrw_addr;
    lprint("Read 0x%x at memory 0x%x\n",value,mrw_addr);

    return;

error:
    lprint("Err!\nr [(hexaddr)](last addr default)\n");

}

void lmemset(char *d,unsigned char v,unsigned int n)
{
	while(n--)*d++=v;
}

void handle_cmd()
{
    unsigned char i = 0;
    char *p_cmd, *p_buf;

    lprint("\n");
    if(!cmd_buf[0])
	return;
    //record the history cmd
    review_cmd_his_index = cmdcache_index;
    strcpy((char*)cmd_caches[cmdcache_index++], cmd_buf);
    if(cmdcache_index==CMD_CACHES_SIZE){
        cmdcache_index = 0;
    }
    while(1){
	    if(cmd_list[i].cmd_name == NULL)
		    break;
	    p_cmd=cmd_list[i].cmd_name;
	    p_buf=cmd_buf;
	    while(*p_cmd){
		    if(*p_buf != *p_cmd)
			    break;
		    p_buf++;
		    p_cmd++;
	    }
	    if(!(*p_cmd) && (*p_buf == ' ' || !(*p_buf))){
            	    cmd_list[i].cmd_fun(p_buf);
                    lprint("'%s' done.\n", cmd_list[i].cmd_name);
            	    return;
       	    }
	    i++;
    }
    lprint("Unknow cmd:%s\n%s",cmd_buf, "Please check the cmd list.");
}

uint time_limit_recv_byte(uint limit, char * c);
void run_cmd_interface()
{
    char c = 0, last_c = 0;
    int timeout = 3;

    mrw_addr = (uint32_t*)0x20000000;
    lprintf("Version %s%s\n", VERSION, GIT_SHA1);
    lprint("\n\nclean_cmd. \n'c' key go cmd...\n");
    while(timeout--){
        delay_ms(1000);
        if(con_is_recved() && (con_recv() == 'c'))break;
        lprintf("timeout %d\n", timeout);
        if(timeout == 1){
            lprintf("Timeout. Quit cmd\n");
            return;
        }
    }
    lmemset(cmd_buf, 0, COM_MAX_LEN);
    memset(&cmd_caches[0][0], 0, CMD_CACHES_SIZE*COM_MAX_LEN);;
    cmd_buf_p = 0;
    lprint("\nCleanCMD>");

    while(!quit_cmd){
        last_c = c;
        c = con_recv();
        if(c == ENTER_CHAR || c == 0x1b || c== 0x03){
            if(c == ENTER_CHAR){
                handle_cmd();
                lprintf("\n");
            }
            if(c == 0x03){
                lprintf("^C\n");
            }
            if(c == 0x1b){
                lprintf("\n");
            }
            lmemset(cmd_buf, 0, COM_MAX_LEN);
            cmd_buf_p = 0;
            lprint("CleanCMD>");
        }
        else if(c == 0x08){
            if(!cmd_buf_p)
                continue;
            cmd_buf[--cmd_buf_p] = 0;
            lprintf("\b \b");
        }
        else if(c == 0x7f){
            if(!cmd_buf_p)
                continue;
            cmd_buf[--cmd_buf_p] = 0;
            con_send(c);
        }
        else if(c == 0x5B && last_c == 0x1b){//history cmd
            strcpy(cmd_buf, (char*)cmd_caches[review_cmd_his_index]);
            cmd_buf_p = strlen(cmd_buf);
            lprintf("%s", cmd_caches[review_cmd_his_index]);
            if(review_cmd_his_index==0){
                review_cmd_his_index=CMD_CACHES_SIZE;
            }
            review_cmd_his_index--;
        }
        else{
            if(cmd_buf_p < (COM_MAX_LEN - 1)){
                cmd_buf[cmd_buf_p++] = c;
                con_send(c);
            }
        }
    }
    quit_cmd = 0;
}
